In [22]:
import pandas as pd

df0 = pd.DataFrame.from_dict({
    'Name': ['Jane', 'Nik', 'Kate'],
    'Age': [10, 35, 34],
    'Height': [130, 178, 155],
    'Weight': [80, 200, 220]
}).set_index('Name')

df1 = pd.DataFrame.from_dict({
    'Name': ['Melissa', 'Evan', 'Doug', 'Joe'],
    'Height': [133, 195, 150, 205],
    'Weight': [150, 140, 95, 180]
}).set_index('Name')

In [23]:
df0

      Age  Height  Weight
Name
Jane   10     130      80
Nik    35     178     200
Kate   34     155     220

In [26]:
df1

         Height  Weight
Name
Melissa     133     150
Evan        195     140
Doug        150      95
Joe         205     180

In [24]:
df=pd.concat([df0, df1])

In [25]:
df

          Age  Height  Weight
Name
Jane     10.0     130      80
Nik      35.0     178     200
Kate     34.0     155     220
Melissa   NaN     133     150
Evan      NaN     195     140
Doug      NaN     150      95
Joe       NaN     205     180

In [27]:
print(df.isnull().sum())

Age       4
Height    0
Weight    0
dtype: int64

In [28]:
df_full=df.dropna(axis=1)

In [29]:
df_full

         Height  Weight
Name
Jane        130      80
Nik         178     200
Kate        155     220
Melissa     133     150
Evan        195     140
Doug        150      95
Joe         205     180